## Production: lambdas
**✅ &nbsp; Terraform Init:** `success`
**✅ &nbsp; Terraform Validate:** `success`
**✅ &nbsp; Terraform Format:** `success`
**✅ &nbsp; Terraform Plan:** `success`
**✅ &nbsp; Conftest:** `success` 

```terraform
Plan: 0 to add, 7 to change, 0 to destroy
```

<details>
<summary>Show summary</summary>

| CHANGE |                 NAME                  |
|--------|---------------------------------------|
| update | `aws_lambda_function.form_archiver`   |
|        | `aws_lambda_function.nagware`         |
|        | `aws_lambda_function.reliability`     |
|        | `aws_lambda_function.vault_integrity` |
|        | `aws_s3_object.form_archiver_code`    |
|        | `aws_s3_object.nagware_code`          |
|        | `aws_s3_object.reliability_code`      |


</details>


<details>
<summary>Show plan</summary>

```terraform
Resource actions are indicated with the following symbols:
  ~ update in-place

Terraform will perform the following actions:

  # aws_lambda_function.form_archiver will be updated in-place
  ~ resource "aws_lambda_function" "form_archiver" {
        id                             = "Archive_Form_Templates"
      ~ last_modified                  = "2024-02-13T15:11:44.117+0000" -> (known after apply)
      ~ s3_object_version              = "CvGr1NRzUS26M8LTfdr2ZoafTquGGCqu" -> (known after apply)
      ~ source_code_hash               = "Az0liG599yfRg7cqDAtpcwSYHtgtsQI2m7K2x/krsxY=" -> "tZom8NvYkLTCiFBHAx0p97qloJ1ZcMMumoKxxhc4SWc="
        tags                           = {}
        # (21 unchanged attributes hidden)

      ~ environment {
          ~ variables = {
              - "ENVIRONMENT" = "production" -> null
              - "LOCALSTACK"  = "false" -> null
                # (4 unchanged elements hidden)
            }
        }

        # (2 unchanged blocks hidden)
    }

  # aws_lambda_function.nagware will be updated in-place
  ~ resource "aws_lambda_function" "nagware" {
        id                             = "Nagware"
      ~ last_modified                  = "2024-02-13T15:11:55.646+0000" -> (known after apply)
      ~ s3_object_version              = "VOCEGOljS9FmQI1tTA8.DdOd2C5IyXJ7" -> (known after apply)
      ~ source_code_hash               = "2ZP5o8tCbep27P53xhm8tjX9DytomL5qhN8DZAlAVhQ=" -> "ewsERJHdgUqXPuAunXW9Djvue3VCJbRmdbJySbEUXMY="
        tags                           = {}
        # (21 unchanged attributes hidden)

        # (3 unchanged blocks hidden)
    }

  # aws_lambda_function.reliability will be updated in-place
  ~ resource "aws_lambda_function" "reliability" {
        id                             = "Reliability"
      ~ last_modified                  = "2024-03-19T14:40:49.000+0000" -> (known after apply)
      ~ s3_object_version              = "73aJpYZu4ddJ9Ox8lP3mCSbZqYFIodCy" -> (known after apply)
      ~ source_code_hash               = "7GytmQkLshgAsM56ZBQ2wQlnmEMfU7gagap8ylA+StE=" -> "VfnhFxgRiQhRaOOzhvqorDCLZ95Numn4J8eGPARS0uk="
        tags                           = {}
        # (21 unchanged attributes hidden)

        # (3 unchanged blocks hidden)
    }

  # aws_lambda_function.vault_integrity will be updated in-place
  ~ resource "aws_lambda_function" "vault_integrity" {
        id                             = "Vault_Data_Integrity_Check"
      ~ last_modified                  = "2024-03-26T14:13:04.000+0000" -> (known after apply)
      ~ source_code_hash               = "9lDCUtEgnDGaN0b7aU2yhDlM0DDumsUYZhbUsYDuAF4=" -> "TowbMcppnki+0a5fq50Oral3CqleiwGw7U1igvFz0Ws="
        tags                           = {}
        # (24 unchanged attributes hidden)

        # (3 unchanged blocks hidden)
    }

  # aws_s3_object.form_archiver_code will be updated in-place
  ~ resource "aws_s3_object" "form_archiver_code" {
        id                     = "form_archiver_code"
      ~ source_hash            = "Az0liG599yfRg7cqDAtpcwSYHtgtsQI2m7K2x/krsxY=" -> "tZom8NvYkLTCiFBHAx0p97qloJ1ZcMMumoKxxhc4SWc="
        tags                   = {}
      ~ version_id             = "CvGr1NRzUS26M8LTfdr2ZoafTquGGCqu" -> (known after apply)
        # (11 unchanged attributes hidden)
    }

  # aws_s3_object.nagware_code will be updated in-place
  ~ resource "aws_s3_object" "nagware_code" {
        id                     = "nagware_code"
      ~ source_hash            = "2ZP5o8tCbep27P53xhm8tjX9DytomL5qhN8DZAlAVhQ=" -> "ewsERJHdgUqXPuAunXW9Djvue3VCJbRmdbJySbEUXMY="
        tags                   = {}
      ~ version_id             = "VOCEGOljS9FmQI1tTA8.DdOd2C5IyXJ7" -> (known after apply)
        # (11 unchanged attributes hidden)
    }

  # aws_s3_object.reliability_code will be updated in-place
  ~ resource "aws_s3_object" "reliability_code" {
        id                     = "reliability_code"
      ~ source_hash            = "7GytmQkLshgAsM56ZBQ2wQlnmEMfU7gagap8ylA+StE=" -> "VfnhFxgRiQhRaOOzhvqorDCLZ95Numn4J8eGPARS0uk="
        tags                   = {}
      ~ version_id             = "73aJpYZu4ddJ9Ox8lP3mCSbZqYFIodCy" -> (known after apply)
        # (11 unchanged attributes hidden)
    }

Plan: 0 to add, 7 to change, 0 to destroy.

─────────────────────────────────────────────────────────────────────────────

Saved the plan to: plan.tfplan

To perform exactly these actions, run the following command to apply:
    terraform apply "plan.tfplan"

```

</details>

<details>
<summary>Show Conftest results</summary>

```sh
WARN - plan.json - main - Missing Common Tags: ["aws_cloudwatch_event_rule.audit_logs_archiver_lambda_trigger"]
WARN - plan.json - main - Missing Common Tags: ["aws_cloudwatch_event_rule.form_archiver_lambda_trigger"]
WARN - plan.json - main - Missing Common Tags: ["aws_cloudwatch_event_rule.nagware_lambda_trigger"]
WARN - plan.json - main - Missing Common Tags: ["aws_cloudwatch_event_rule.reliability_dlq_lambda_trigger"]
WARN - plan.json - main - Missing Common Tags: ["aws_cloudwatch_event_rule.response_archiver_lambda_trigger"]
WARN - plan.json - main - Missing Common Tags: ["aws_cloudwatch_log_group.archive_form_templates"]
WARN - plan.json - main - Missing Common Tags: ["aws_cloudwatch_log_group.audit_logs"]
WARN - plan.json - main - Missing Common Tags: ["aws_cloudwatch_log_group.audit_logs_archiver"]
WARN - plan.json - main - Missing Common Tags: ["aws_cloudwatch_log_group.dead_letter_queue_consumer"]
WARN - plan.json - main - Missing Common Tags: ["aws_cloudwatch_log_group.nagware"]
WARN - plan.json - main - Missing Common Tags: ["aws_cloudwatch_log_group.reliability"]
WARN - plan.json - main - Missing Common Tags: ["aws_cloudwatch_log_group.response_archiver"]
WARN - plan.json - main - Missing Common Tags: ["aws_cloudwatch_log_group.submission"]
WARN - plan.json - main - Missing Common Tags: ["aws_cloudwatch_log_group.vault_integrity"]
WARN - plan.json - main - Missing Common Tags: ["aws_iam_policy.lambda_dynamodb"]
WARN - plan.json - main - Missing Common Tags: ["aws_iam_policy.lambda_kms"]
WARN - plan.json - main - Missing Common Tags: ["aws_iam_policy.lambda_logging"]
WARN - plan.json - main - Missing Common Tags: ["aws_iam_policy.lambda_rds"]
WARN - plan.json - main - Missing Common Tags: ["aws_iam_policy.lambda_s3"]
WARN - plan.json - main - Missing Common Tags: ["aws_iam_policy.lambda_secrets"]
WARN - plan.json - main - Missing Common Tags: ["aws_iam_policy.lambda_sns"]
WARN - plan.json - main - Missing Common Tags: ["aws_iam_policy.lambda_sqs"]
WARN -...
```

</details>
